[Rainmeter]
Update=1000
AccurateText=0
DynamicWindowSize=0
Group=ToggleByAssistBtn

[Metadata]
Name=Rhodes_Island_UI
Author=热心炎国云玩家
Information=让您在PC上也能享受到罗德岛终端系统的交互界面。|用户信息，等级记录了系统本次的正常运行时间。
License=Closure Commons 署名-不许获利-传递下去 42.0
Version=0.10.0

[Variables]
@Include1=#@#GlobalVars.inc
@Include2=#@#Includes\mUptime.inc


;阵营图章 ;"我愿意加入罗德岛。"
[ProfileBadge]
Meter=Image
ImageTint=140,140,140,215
ImageName=#UserBadge#
X=0
Y=0
W=315
H=315


;长方形背景
[ProfileBg]
Meter=Image
SolidColor=50,50,50,255
X=0
Y=146
W=290
H=50

[ProfileBgText]
Meter=String
MeterStyle=styFontAN
FontColor=255,255,255,255
FontSize=18
StringAlign=CenterCenter
Text=LV
X=-65R
Y=15r


;经验值计量表 ;"就这样？"
[ProfileExpCircleBk]
Meter=Roundline
AntiAlias=1
LineColor=255,255,255,51
Solid=1
LineStart=65
LineLength=70
StartAngle=(Rad(270))
RotationAngle=(Rad(360))
X=155
Y=48
W=140
H=140

[ProfileExpCircle]
Meter=Roundline
MeasureName=mUptimeMinsProg
AntiAlias=1
LineColor=255,216,2,255
Solid=1
LineStart=65
LineLength=70
StartAngle=(Rad(270))
RotationAngle=(Rad(360))
X=0r
Y=0r
W=140
H=140


;"レベルア～ップ！！"
[ProfileLv]
Meter=String
MeasureName=mUptimeHours
MeterStyle=styFontAN
FontColor=255,255,255,255
FontSize=54
StringAlign=CenterCenter
X=[ProfileBgText:X]
Y=([ProfileBg:Y]-32)


;用户名与ID
[ProfileName]
Meter=String
MeterStyle=styFontText
FontColor=255,255,255,255
FontSize=28
StringAlign=CenterCenter
Text=#UserName#
X=([ProfileBgText:X]+0)
Y=([ProfileBgText:Y]+70)

[ProfileID]
Meter=String
MeterStyle=styFontTextThin
FontColor=255,255,255,255
FontSize=14
StringAlign=CenterCenter
Text=#UserID#
X=[ProfileBgText:X]
Y=32r